<center>
  <a href="2.2-intro-to-pandas-data-structures.ipynb">Previous Page</a> | <a href="./">Content Page</a> | <a href="2.4-intro-to-python-viz.ipynb">Next Page</a></center>
</center>

# 2.3 Munging Defined 

- Shape dataset so it feeds easily into visualisation tools and machine learning models
- Involved similar set operations for most datasets 
- Cleaning: Strings changed to numbers, numbers/strings changed to dates, missing values dealt with, pruning columns 
- Transformation: Data grouped into meaningful subsets, summary statistics calculated, further filtering

we will take you through all the usual munging steps. 

resale prices for HDBs from 2012 onwards 

Variables include: 

- Quarter and Year (need to split this variable and change format) 
- Town 
- Flat Type
- Price

In [69]:
import pandas as pd 
import numpy as np

# 2.3.1 First look at the data

In [70]:
# load data 
resale = pd.read_csv("resale.csv")

In [71]:
# take a first look 
resale.head()

   quarter        town flat_type     price
0  2012-03  ANG MO KIO    2 ROOM  250000.0
1  2012-03  ANG MO KIO    2 ROOM  265000.0
2  2012-03  ANG MO KIO    3 ROOM  315000.0
3  2012-03  ANG MO KIO    3 ROOM  320000.0
4  2012-03  ANG MO KIO    3 ROOM  321000.0

In [72]:
# how many rows and columns?  
resale.shape

(102100, 4)

In [73]:
# look for unique values 
resale["town"].unique()

array(['ANG MO KIO', 'BEDOK', 'BISHAN', 'BUKIT BATOK', 'BUKIT MERAH',
       'BUKIT PANJANG', 'BUKIT TIMAH', 'CENTRAL AREA', 'CHOA CHU KANG',
       'CLEMENTI', 'GEYLANG', 'HOUGANG', 'JURONG EAST', 'JURONG WEST',
       'KALLANG/WHAMPOA', 'MARINE PARADE', 'PASIR RIS', 'PUNGGOL',
       'QUEENSTOWN', 'SEMBAWANG', 'SENGKANG', 'SERANGOON', 'TAMPINES',
       'TOA PAYOH', 'WOODLANDS', 'YISHUN'], dtype=object)

In [74]:
resale["quarter"].unique()

array(['2012-03', '2012-04', '2012-05', '2012-06', '2012-07', '2012-08',
       '2012-09', '2012-10', '2012-11', '2012-12', '2013-01', '2013-02',
       '2013-03', '2013-04', '2013-05', '2013-06', '2013-07', '2013-08',
       '2013-09', '2013-10', '2013-11', '2013-12', '2014-01', '2014-02',
       '2014-03', '2014-04', '2014-05', '2014-06', '2014-07', '2014-08',
       '2014-09', '2014-10', '2014-11', '2014-12', '2015-01', '2015-02',
       '2015-03', '2015-04', '2015-05', '2015-06', '2015-07', '2015-08',
       '2015-09', '2015-10', '2015-11', '2015-12', '2016-01', '2016-02',
       '2016-03', '2016-04', '2016-05', '2016-06', '2016-07', '2016-08',
       '2016-09', '2016-10', '2016-11', '2016-12', '2017-01', '2017-02',
       '2017-03', '2017-04', '2017-05', '2017-06', '2017-07'], dtype=object)

In [75]:
# look at data type

resale[["price"]] = resale[["price"]].apply(pd.to_numeric, errors = "coerce")
resale["price"].head()

0    250000.0
1    265000.0
2    315000.0
3    320000.0
4    321000.0
Name: price, dtype: float64

In [76]:
# quick intro into indexing - slicing
# create a small dataset with 10 rows 
head = resale.head(10)
# access a column
head['price']

0    250000.0
1    265000.0
2    315000.0
3    320000.0
4    321000.0
5    321000.0
6    323000.0
7    325000.0
8    328000.0
9    330000.0
Name: price, dtype: float64

In [77]:
# first row, keep all columns
head.iloc[1,:]

quarter         2012-03
town         ANG MO KIO
flat_type        2 ROOM
price            265000
Name: 1, dtype: object

In [78]:
# all rows, only second column
head.iloc[:,2]

0    2 ROOM
1    2 ROOM
2    3 ROOM
3    3 ROOM
4    3 ROOM
5    3 ROOM
6    3 ROOM
7    3 ROOM
8    3 ROOM
9    3 ROOM
Name: flat_type, dtype: object

In [79]:
head.loc[head.price > 100000.0, :]

   quarter        town flat_type     price
0  2012-03  ANG MO KIO    2 ROOM  250000.0
1  2012-03  ANG MO KIO    2 ROOM  265000.0
2  2012-03  ANG MO KIO    3 ROOM  315000.0
3  2012-03  ANG MO KIO    3 ROOM  320000.0
4  2012-03  ANG MO KIO    3 ROOM  321000.0
5  2012-03  ANG MO KIO    3 ROOM  321000.0
6  2012-03  ANG MO KIO    3 ROOM  323000.0
7  2012-03  ANG MO KIO    3 ROOM  325000.0
8  2012-03  ANG MO KIO    3 ROOM  328000.0
9  2012-03  ANG MO KIO    3 ROOM  330000.0

In [80]:
head.loc[head.price > 200000.0, ['quarter','town']]

   quarter        town
0  2012-03  ANG MO KIO
1  2012-03  ANG MO KIO
2  2012-03  ANG MO KIO
3  2012-03  ANG MO KIO
4  2012-03  ANG MO KIO
5  2012-03  ANG MO KIO
6  2012-03  ANG MO KIO
7  2012-03  ANG MO KIO
8  2012-03  ANG MO KIO
9  2012-03  ANG MO KIO

In [81]:
# quick intro into hierarchical indexing

# 2.3.2 Cleaning: Dealing with missing values, outliers and time formats

## Missing Values 
Real world data, or data "in the wild", is rarely standardised. Often, especially with surveys, fields are not filled in and hence we have to deal with missing values. Pandas provides several tools to handle missing data.

In [82]:
# Generate a boolean mask showing missing values 
resale_small = resale["price"].head()
resale_small.isnull()

0    False
1    False
2    False
3    False
4    False
Name: price, dtype: bool

In [83]:
# similarly, create a boolean mask, but this time showing non-missing values 
resale_small.notnull()

0    True
1    True
2    True
3    True
4    True
Name: price, dtype: bool

In [84]:
# notnull becomes usef when we use the boolean array as an index 
# here, all NaN values for price are filtered out 
resale_small[resale_small.notnull()]

0    250000.0
1    265000.0
2    315000.0
3    320000.0
4    321000.0
Name: price, dtype: float64

In [85]:
# dropping null values 
resale_small.dropna()

0    250000.0
1    265000.0
2    315000.0
3    320000.0
4    321000.0
Name: price, dtype: float64

In [86]:
# filter rows with NaN

In [87]:
# filter columns with NaN

Especially when our dataset is small, and we want to preserve information as much as we can, we don't have to drop NaN values. Instead, we can replace them with zero, and retain the information in the other columns. Even better, we can fill NaN values with an average or some other value.

In [88]:
# filling with zero
resale_small.fillna(0)

0    250000.0
1    265000.0
2    315000.0
3    320000.0
4    321000.0
Name: price, dtype: float64

In [89]:
# propagate previous value backward 
resale_small.fillna(method='bfill')

0    250000.0
1    265000.0
2    315000.0
3    320000.0
4    321000.0
Name: price, dtype: float64

In [90]:
# propagate previous value forward 
resale_small.fillna(method='ffill')

0    250000.0
1    265000.0
2    315000.0
3    320000.0
4    321000.0
Name: price, dtype: float64

## 2.3.3 Transforming Data with a Mapping

In [91]:
district = resale.head(23)
district

    quarter        town flat_type     price
0   2012-03  ANG MO KIO    2 ROOM  250000.0
1   2012-03  ANG MO KIO    2 ROOM  265000.0
2   2012-03  ANG MO KIO    3 ROOM  315000.0
3   2012-03  ANG MO KIO    3 ROOM  320000.0
4   2012-03  ANG MO KIO    3 ROOM  321000.0
5   2012-03  ANG MO KIO    3 ROOM  321000.0
6   2012-03  ANG MO KIO    3 ROOM  323000.0
7   2012-03  ANG MO KIO    3 ROOM  325000.0
8   2012-03  ANG MO KIO    3 ROOM  328000.0
9   2012-03  ANG MO KIO    3 ROOM  330000.0
10  2012-03  ANG MO KIO    3 ROOM  331000.0
11  2012-03  ANG MO KIO    3 ROOM  332000.0
12  2012-03  ANG MO KIO    3 ROOM  333000.0
13  2012-03  ANG MO KIO    3 ROOM  333000.0
14  2012-03  ANG MO KIO    3 ROOM  335000.0
15  2012-03  ANG MO KIO    3 ROOM  336000.0
16  2012-03  ANG MO KIO    3 ROOM  336000.0
17  2012-03  ANG MO KIO    3 ROOM  336000.0
18  2012-03  ANG MO KIO    3 ROOM  338000.0
19  2012-03  ANG MO KIO    3 ROOM  339000.0
20  2012-03  ANG MO KIO    3 ROOM  339000.0
21  2012-03  ANG MO KIO    3 ROOM  340000.0
22  2012-03  ANG MO KIO    3 ROOM  340000.0

In [92]:
map = {
    'ANG MO KIO' : 'North East',
    'BEDOK' : 'East',
    'BUKIT TIMAH' : 'Central',
    'BUKIT BATOK' : 'West',
    'BISHAN' : 'Central'
}

In [93]:
district['area'] = district['town'].map(map) 
district

/home/najib/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    quarter        town flat_type     price        area
0   2012-03  ANG MO KIO    2 ROOM  250000.0  North East
1   2012-03  ANG MO KIO    2 ROOM  265000.0  North East
2   2012-03  ANG MO KIO    3 ROOM  315000.0  North East
3   2012-03  ANG MO KIO    3 ROOM  320000.0  North East
4   2012-03  ANG MO KIO    3 ROOM  321000.0  North East
5   2012-03  ANG MO KIO    3 ROOM  321000.0  North East
6   2012-03  ANG MO KIO    3 ROOM  323000.0  North East
7   2012-03  ANG MO KIO    3 ROOM  325000.0  North East
8   2012-03  ANG MO KIO    3 ROOM  328000.0  North East
9   2012-03  ANG MO KIO    3 ROOM  330000.0  North East
10  2012-03  ANG MO KIO    3 ROOM  331000.0  North East
11  2012-03  ANG MO KIO    3 ROOM  332000.0  North East
12  2012-03  ANG MO KIO    3 ROOM  333000.0  North East
13  2012-03  ANG MO KIO    3 ROOM  333000.0  North East
14  2012-03  ANG MO KIO    3 ROOM  335000.0  North East
15  2012-03  ANG MO KIO    3 ROOM  336000.0  North East
16  2012-03  ANG MO KIO    3 ROOM  336000.0  North East
17  2012-03  ANG MO KIO    3 ROOM  336000.0  North East
18  2012-03  ANG MO KIO    3 ROOM  338000.0  North East
19  2012-03  ANG MO KIO    3 ROOM  339000.0  North East
20  2012-03  ANG MO KIO    3 ROOM  339000.0  North East
21  2012-03  ANG MO KIO    3 ROOM  340000.0  North East
22  2012-03  ANG MO KIO    3 ROOM  340000.0  North East

## String Operations

In [94]:
resale['Year'], resale['Quarter'] = resale['quarter'].str.split('-',1).str
resale.head()

   quarter        town flat_type     price  Year Quarter
0  2012-03  ANG MO KIO    2 ROOM  250000.0  2012      03
1  2012-03  ANG MO KIO    2 ROOM  265000.0  2012      03
2  2012-03  ANG MO KIO    3 ROOM  315000.0  2012      03
3  2012-03  ANG MO KIO    3 ROOM  320000.0  2012      03
4  2012-03  ANG MO KIO    3 ROOM  321000.0  2012      03

In [95]:
# save our clean data 
resale.to_csv('clean_resale.csv')

# Drop Columns

In [96]:
# drop columns
# inplace so that original data can be modified without creating a copy.
resale.drop('quarter', axis = 1, inplace=True)
resale.head()

         town flat_type     price  Year Quarter
0  ANG MO KIO    2 ROOM  250000.0  2012      03
1  ANG MO KIO    2 ROOM  265000.0  2012      03
2  ANG MO KIO    3 ROOM  315000.0  2012      03
3  ANG MO KIO    3 ROOM  320000.0  2012      03
4  ANG MO KIO    3 ROOM  321000.0  2012      03

Other string operations include contains **count, endswith, startswith, findall, lower, upper, math, strip, etc.**

## Dealing with time format

In [97]:
resale['Year'].dtype

dtype('O')

In [98]:
from datetime import datetime 
resale['Year'] = pd.to_datetime(resale['Year'])
resale['Year'].dtype

dtype('<M8[ns]')

In [99]:
resale['Year'] = [x.strftime('%Y') for x in resale['Year']]
resale.head()

         town flat_type     price  Year Quarter
0  ANG MO KIO    2 ROOM  250000.0  2012      03
1  ANG MO KIO    2 ROOM  265000.0  2012      03
2  ANG MO KIO    3 ROOM  315000.0  2012      03
3  ANG MO KIO    3 ROOM  320000.0  2012      03
4  ANG MO KIO    3 ROOM  321000.0  2012      03

In [100]:
resale['Year'].dtype

dtype('O')

# 2.3.4 Supplementing our dataset with more data: Merging and Joining Datasets

Before we purchase a property, it's useful to take note of any amneties nearby, particularly schools. Our original dataset doesn't come with information about schools, but with Pandas, adding information to our dataset is easy with the merge( ) function.

In [101]:
# create two data frames 
# price of 4-room for 2016 
price = pd.DataFrame({'town': ['Yishun','Woodlands','Toa Payoh','Tampines','Serangoon'],
                        'price' : [369000,350000,565000,430000,465000]})
# number of secondary schools in area in 2016
schools = pd.DataFrame({'town' : ['Woodlands','Yishun','Toa Payoh','Tampines','Serangoon'],
                        'school_num' : [10,9,6,10,4]})

In [102]:
price

    price       town
0  369000     Yishun
1  350000  Woodlands
2  565000  Toa Payoh
3  430000   Tampines
4  465000  Serangoon

In [103]:
schools

   school_num       town
0          10  Woodlands
1           9     Yishun
2           6  Toa Payoh
3          10   Tampines
4           4  Serangoon

In [104]:
# combine both data frames into one 
merged = pd.merge(price, schools)
merged

    price       town  school_num
0  369000     Yishun           9
1  350000  Woodlands          10
2  565000  Toa Payoh           6
3  430000   Tampines          10
4  465000  Serangoon           4

Note that the pd.merge( ) function sees that each DataFrame has an 'employee' column and hence joins using this column as a key. Hence we have painlessly combines the information from the two inputs. 

For the SQL folks, pd.merge( ) allows more complex joins such as many-to-many joins, left joins, inner joins etc. See the documentation for more details, or Wes McKinney's Python for Data Analysis is a great resource.

A quick alternative to the pd.merge( ) function is the pd.concat( ) function. This function allows us to specify whether to join the DataFrame by column or rows.

In [105]:
pd.concat([price, schools], axis=1)

    price       town  school_num       town
0  369000     Yishun          10  Woodlands
1  350000  Woodlands           9     Yishun
2  565000  Toa Payoh           6  Toa Payoh
3  430000   Tampines          10   Tampines
4  465000  Serangoon           4  Serangoon

In [106]:
# row-wise by default 

price_2 = pd.DataFrame({'town': ['Sengkang','Sembawang'],
                        'price' : [408000,361500]})
pd.concat([price, price_2])

    price       town
0  369000     Yishun
1  350000  Woodlands
2  565000  Toa Payoh
3  430000   Tampines
4  465000  Serangoon
0  408000   Sengkang
1  361500  Sembawang

# Aggregation

After loading our dataset, cleaning up our NaN values, merging our datasets and wrangling with data types, a common next step is to look at group statistics such as the mean or median to get a better feel for our data. In general terms, we can say we want to split our dataset into interesting groups, and apply a function to each group. For this, pandas groupby facility is particularly useful, and allows us to summarise our datasets flexibly and naturally. 

Indeed, one of the reasons why SQL and relational databases are so popular is that they easily join, filter and transform datasets. However, the group operations they can perform are limited. Pandas is more expressive than SQL, and thus allows more complex grouped operations. As long as a function can accept a pandas object or NumPy array, we'll be fine. 

Here, we'll look at: 

- Performing aggregation using the Split-Apply-Combine paradigm 
- Pivot Tables 
references: Python4DataAnalysis by Wes McKinney and PythonDataScienceHandbook by Jake Van der Plas

## Split-Apply-Combine 
![alt text](splitapplycombine.png)

When dealing with groups (aggregations), we follow a process. Namely, we *split* the data, be it a column or a row, accodring to a certain *key*. Then, we *apply* a function such as a sum calculation to each group. Finally, we *combine* the results of the function into a new object. 

To make things concrete, let's look at an example, using the HDB resale dataset from before

In [107]:
resale.head()

         town flat_type     price  Year Quarter
0  ANG MO KIO    2 ROOM  250000.0  2012      03
1  ANG MO KIO    2 ROOM  265000.0  2012      03
2  ANG MO KIO    3 ROOM  315000.0  2012      03
3  ANG MO KIO    3 ROOM  320000.0  2012      03
4  ANG MO KIO    3 ROOM  321000.0  2012      03

In [108]:
# create groupby object that is ready for apply operation that follows.
grouped = resale['price'].groupby(resale['Year'])
grouped

In [109]:
# apply mean operation 
grouped.mean()

Year
2012    463846.156286
2013    476441.007916
2014    442716.050032
2015    435089.066912
2016    438828.779501
2017    441286.333930
Name: price, dtype: float64

In [110]:
# another example 
grouped = resale['price'].groupby(resale['town'])
grouped.mean()

town
ANG MO KIO         418629.835860
BEDOK              420083.763501
BISHAN             603194.968755
BUKIT BATOK        406086.975042
BUKIT MERAH        549422.586624
BUKIT PANJANG      436063.313869
BUKIT TIMAH        686751.436364
CENTRAL AREA       594591.738516
CHOA CHU KANG      424124.816843
CLEMENTI           453809.064925
GEYLANG            416844.563366
HOUGANG            439971.934172
JURONG EAST        427668.323676
JURONG WEST        423513.131033
KALLANG/WHAMPOA    484142.104803
MARINE PARADE      548716.566761
PASIR RIS          499200.897603
PUNGGOL            475450.461400
QUEENSTOWN         521215.986494
SEMBAWANG          433745.329306
SENGKANG           470693.920612
SERANGOON          481986.034298
TAMPINES           469384.207702
TOA PAYOH          458751.424907
WOODLANDS          416647.378980
YISHUN             377261.378079
Name: price, dtype: float64

In [111]:
# combine keys 
grouped = resale['price'].groupby([resale['Year'], resale['town']])
grouped.mean()

Year  town
2012  ANG MO KIO         423926.115583
      BEDOK              435085.510443
      BISHAN             573391.375014
      BUKIT BATOK        426705.023464
      BUKIT MERAH        543007.447742
      BUKIT PANJANG      463580.672857
      BUKIT TIMAH        633943.589744
      CENTRAL AREA       482081.200000
      CHOA CHU KANG      463336.076063
      CLEMENTI           454330.416162
      GEYLANG            420075.440917
      HOUGANG            461066.632351
      JURONG EAST        422727.743304
      JURONG WEST        448117.128894
      KALLANG/WHAMPOA    464383.884477
      MARINE PARADE      557891.380282
      PASIR RIS          523148.629167
      PUNGGOL            530620.214838
      QUEENSTOWN         491198.211782
      SEMBAWANG          473617.946830
      SENGKANG           514490.398092
      SERANGOON          493556.200969
      TAMPINES           480685.018284
      TOA PAYOH          474359.841860
      WOODLANDS          431818.357867
      YISHUN             398038.690386
2013  ANG MO KIO         434408.974490
      BEDOK              445668.299015
      BISHAN             603629.229452
      BUKIT BATOK        434037.287081
                             ...
2016  TAMPINES           455846.508100
      TOA PAYOH          443872.063291
      WOODLANDS          400388.615889
      YISHUN             365747.932082
2017  ANG MO KIO         432011.134545
      BEDOK              406979.342949
      BISHAN             675280.047244
      BUKIT BATOK        376990.401891
      BUKIT MERAH        557139.097825
      BUKIT PANJANG      425299.864721
      BUKIT TIMAH        716218.580645
      CENTRAL AREA       630169.715596
      CHOA CHU KANG      389293.790646
      CLEMENTI           470082.188679
      GEYLANG            405989.374172
      HOUGANG            429407.371765
      JURONG EAST        413022.107884
      JURONG WEST        394621.671422
      KALLANG/WHAMPOA    501015.223684
      MARINE PARADE      531090.410959
      PASIR RIS          480837.322404
      PUNGGOL            452409.040602
      QUEENSTOWN         558470.684521
      SEMBAWANG          398275.593548
      SENGKANG           430221.643182
      SERANGOON          479108.388664
      TAMPINES           469490.667560
      TOA PAYOH          475513.474359
      WOODLANDS          387981.183411
      YISHUN             355713.520661
Name: price, Length: 156, dtype: float64

In [112]:
# code above allows grouping with a series not in the data frame
# if grouping information is in the same data frame, we have a shorter way:
# non-numerical column automatically dropped. 
grouped = resale.groupby('town').mean()
grouped.head()

                     price
town
ANG MO KIO   418629.835860
BEDOK        420083.763501
BISHAN       603194.968755
BUKIT BATOK  406086.975042
BUKIT MERAH  549422.586624

In [113]:
# group with a mapping 
# DataFrame of property guru ratings 
import numpy as np
rating = pd.DataFrame(np.random.randint(0,5, size=(4,4)),
                  columns=['Bedok','Changi','Queenstown','Toa Payoh'],
                  index=['Tan','Dennis','Jane','Wong'])
rating

        Bedok  Changi  Queenstown  Toa Payoh
Tan         1       3           1          1
Dennis      4       0           4          4
Jane        4       1           0          1
Wong        1       3           0          2

In [114]:
map = {
    'Bedok' : 'South East',
    'Changi' : 'South East',
    'Queenstown' : 'Central',
    'Toa Payoh' : 'Central'
}

by_column = rating.groupby(map, axis=1)
by_column.mean()

        Central  South East
Tan         1.0         2.0
Dennis      4.0         2.0
Jane        0.5         2.5
Wong        1.0         2.0

In [115]:
# group with a function 
rating.groupby(len).min()

   Bedok  Changi  Queenstown  Toa Payoh
3      1       3           1          1
4      1       1           0          1
6      4       0           4          4

In [116]:
# mixing functions with arrays, dicts or Series is fine - flexibility! 
key_list = ['one','one','two','two']
rating.groupby([len,key_list]).min()

       Bedok  Changi  Queenstown  Toa Payoh
3 one      1       3           1          1
4 two      1       1           0          1
6 one      4       0           4          4

<center>
  <a href="2.2-intro-to-pandas-data-structures.ipynb">Previous Page</a> | <a href="./">Content Page</a> | <a href="2.4-intro-to-python-viz.ipynb">Next Page</a></center>
</center>